scripts/artillery/buy.yml
  config:
    plugins:
      aws-sigv4:
        serviceName: execute-api
    target: "https://b43b2ij4qi.execute-api.us-west-2.amazonaws.com" # this hostname will be used for each part of the flow
    phases:
      -
        duration: 30
        arrivalRate: 33
#        rampTo: 6
  scenarios:
    -
      flow:
        -
          post:
            url: "/workshop051717/event-writer"
            beforeRequest: addAmazonSignatureV4
            json: { "schema": "com.nordstrom/product/purchase/1-0-0", "id": "5407513", "origin": "hello-retail/web-client-purchase-product/amzn1.account.AHMNGKVGNQYJUV7BZZZMFH3HP3KQ/Team Jetpack" }